documents/images/graphio/stdlib/colorcorrect_color3_instance.dot
digraph {
  rankdir = LR;
    NG_colorcorrect_color3_N_exposure [label= "multiply"];
    NG_colorcorrect_color3_N_exposure[shape = box];
    NG_colorcorrect_color3_N_exposure ->     NG_colorcorrect_color3_out;
    NG_colorcorrect_color3_out [label= "out"];
    NG_colorcorrect_color3_out[shape = box]; 
    NG_colorcorrect_color3_N_contrast [label= "contrast"];
    NG_colorcorrect_color3_N_contrast[shape = box];
    NG_colorcorrect_color3_N_contrast ->     NG_colorcorrect_color3_N_exposure [label= "in1"];
    NG_colorcorrect_color3_N_exposure [label= "multiply"];
    NG_colorcorrect_color3_N_exposure[shape = box]; 
    NG_colorcorrect_color3_contrastINT [label="contrast"];
    NG_colorcorrect_color3_contrastINT [shape = ellipse];
    NG_colorcorrect_color3_N_contrast [label="contrast"];
    NG_colorcorrect_color3_contrastINT -> NG_colorcorrect_color3_N_contrast [label=".amount"];
    NG_colorcorrect_color3_contrastpivotINT [label="contrastpivot"];
    NG_colorcorrect_color3_contrastpivotINT [shape = ellipse];
    NG_colorcorrect_color3_N_contrast [label="contrast"];
    NG_colorcorrect_color3_contrastpivotINT -> NG_colorcorrect_color3_N_contrast [label=".pivot"];
    NG_colorcorrect_color3_N_gain [label= "multiply"];
    NG_colorcorrect_color3_N_gain[shape = box];
    NG_colorcorrect_color3_N_gain ->     NG_colorcorrect_color3_N_contrast [label= "in"];
    NG_colorcorrect_color3_N_contrast [label= "contrast"];
    NG_colorcorrect_color3_N_contrast[shape = box]; 
    NG_colorcorrect_color3_gainINT [label="gain"];
    NG_colorcorrect_color3_gainINT [shape = ellipse];
    NG_colorcorrect_color3_N_gain [label="multiply"];
    NG_colorcorrect_color3_gainINT -> NG_colorcorrect_color3_N_gain [label=".in2"];
    NG_colorcorrect_color3_N_liftadd [label= "add"];
    NG_colorcorrect_color3_N_liftadd[shape = box];
    NG_colorcorrect_color3_N_liftadd ->     NG_colorcorrect_color3_N_gain [label= "in1"];
    NG_colorcorrect_color3_N_gain [label= "multiply"];
    NG_colorcorrect_color3_N_gain[shape = box]; 
    NG_colorcorrect_color3_liftINT [label="lift"];
    NG_colorcorrect_color3_liftINT [shape = ellipse];
    NG_colorcorrect_color3_N_liftadd [label="add"];
    NG_colorcorrect_color3_liftINT -> NG_colorcorrect_color3_N_liftadd [label=".in2"];
    NG_colorcorrect_color3_N_liftmult [label= "multiply"];
    NG_colorcorrect_color3_N_liftmult[shape = box];
    NG_colorcorrect_color3_N_liftmult ->     NG_colorcorrect_color3_N_liftadd [label= "in1"];
    NG_colorcorrect_color3_N_liftadd [label= "add"];
    NG_colorcorrect_color3_N_liftadd[shape = box]; 
    NG_colorcorrect_color3_N_gamma [label= "range"];
    NG_colorcorrect_color3_N_gamma[shape = box];
    NG_colorcorrect_color3_N_gamma ->     NG_colorcorrect_color3_N_liftmult [label= "in1"];
    NG_colorcorrect_color3_N_liftmult [label= "multiply"];
    NG_colorcorrect_color3_N_liftmult[shape = box]; 
    NG_colorcorrect_color3_gammaINT [label="gamma"];
    NG_colorcorrect_color3_gammaINT [shape = ellipse];
    NG_colorcorrect_color3_N_gamma [label="range"];
    NG_colorcorrect_color3_gammaINT -> NG_colorcorrect_color3_N_gamma [label=".gamma"];
    NG_colorcorrect_color3_N_saturation [label= "saturate"];
    NG_colorcorrect_color3_N_saturation[shape = box];
    NG_colorcorrect_color3_N_saturation ->     NG_colorcorrect_color3_N_gamma [label= "in"];
    NG_colorcorrect_color3_N_gamma [label= "range"];
    NG_colorcorrect_color3_N_gamma[shape = box]; 
    NG_colorcorrect_color3_saturationINT [label="saturation"];
    NG_colorcorrect_color3_saturationINT [shape = ellipse];
    NG_colorcorrect_color3_N_saturation [label="saturate"];
    NG_colorcorrect_color3_saturationINT -> NG_colorcorrect_color3_N_saturation [label=".amount"];
    NG_colorcorrect_color3_N_hsvadjust [label= "hsvadjust"];
    NG_colorcorrect_color3_N_hsvadjust[shape = box];
    NG_colorcorrect_color3_N_hsvadjust ->     NG_colorcorrect_color3_N_saturation [label= "in"];
    NG_colorcorrect_color3_N_saturation [label= "saturate"];
    NG_colorcorrect_color3_N_saturation[shape = box]; 
    NG_colorcorrect_color3_inINT [label="in"];
    NG_colorcorrect_color3_inINT [shape = ellipse];
    NG_colorcorrect_color3_N_hsvadjust [label="hsvadjust"];
    NG_colorcorrect_color3_inINT -> NG_colorcorrect_color3_N_hsvadjust [label=".in"];
    NG_colorcorrect_color3_N_parm2hue [label= "combine3"];
    NG_colorcorrect_color3_N_parm2hue[shape = box];
    NG_colorcorrect_color3_N_parm2hue ->     NG_colorcorrect_color3_N_hsvadjust [label= "amount"];
    NG_colorcorrect_color3_N_hsvadjust [label= "hsvadjust"];
    NG_colorcorrect_color3_N_hsvadjust[shape = box]; 
    NG_colorcorrect_color3_hueINT [label="hue"];
    NG_colorcorrect_color3_hueINT [shape = ellipse];
    NG_colorcorrect_color3_N_parm2hue [label="combine3"];
    NG_colorcorrect_color3_hueINT -> NG_colorcorrect_color3_N_parm2hue [label=".in1"];
    NG_colorcorrect_color3_N_liftsubtract [label= "subtract"];
    NG_colorcorrect_color3_N_liftsubtract[shape = box];
    NG_colorcorrect_color3_N_liftsubtract ->     NG_colorcorrect_color3_N_liftmult [label= "in2"];
    NG_colorcorrect_color3_N_liftmult [label= "multiply"];
    NG_colorcorrect_color3_N_liftmult[shape = box]; 
    NG_colorcorrect_color3_liftINT [label="lift"];
    NG_colorcorrect_color3_liftINT [shape = ellipse];
    NG_colorcorrect_color3_N_liftsubtract [label="subtract"];
    NG_colorcorrect_color3_liftINT -> NG_colorcorrect_color3_N_liftsubtract [label=".in2"];
    NG_colorcorrect_color3_N_exposurepwr [label= "power"];
    NG_colorcorrect_color3_N_exposurepwr[shape = box];
    NG_colorcorrect_color3_N_exposurepwr ->     NG_colorcorrect_color3_N_exposure [label= "in2"];
    NG_colorcorrect_color3_N_exposure [label= "multiply"];
    NG_colorcorrect_color3_N_exposure[shape = box]; 
    NG_colorcorrect_color3_exposureINT [label="exposure"];
    NG_colorcorrect_color3_exposureINT [shape = ellipse];
    NG_colorcorrect_color3_N_exposurepwr [label="power"];
    NG_colorcorrect_color3_exposureINT -> NG_colorcorrect_color3_N_exposurepwr [label=".in2"];
}
